InformationRegisters/ИтогиЛечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИтогиЛечения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Итог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИтогиДинамическогоКонтроля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументЗакрытия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПервичныйПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ФиксацияИсходаЛечения/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПервичныйПрием = Параметры.ПервичныйПрием;
	ДокументЗакрытия = Параметры.ДокументЗакрытия;
	
	Если Не ЗначениеЗаполнено(ПервичныйПрием) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Заголовок = "Исход маршрута лечения";
	ПрочитатьТекущийИтог();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьТекущийИтог()
	
	МенеджерЗаписи = РегистрыСведений.ИтогиЛечения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ПервичныйПрием = ПервичныйПрием;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		Итог = МенеджерЗаписи.Итог;
		ДатаЗакрытия = МенеджерЗаписи.ДатаЗакрытия;
		Комментарий = МенеджерЗаписи.Комментарий;
		ИтогУжеЗафиксирован = Истина;
	Иначе
		ДатаЗакрытия = НачалоДня(ТекущаяДатаСеанса());
		ИтогУжеЗафиксирован = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьИтогНаСервере()
	
	Если Не ЗначениеЗаполнено(Итог) Тогда
		Возврат "Не выбран исход.";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаЗакрытия) Тогда
		Возврат "Не указана дата закрытия.";
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ИтогиЛечения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ПервичныйПрием = ПервичныйПрием;
	МенеджерЗаписи.Итог = Итог;
	МенеджерЗаписи.ДатаЗакрытия = ДатаЗакрытия;
	МенеджерЗаписи.ДокументЗакрытия = ДокументЗакрытия;
	МенеджерЗаписи.Комментарий = Комментарий;
	МенеджерЗаписи.Записать();
	
	Возврат "";
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	
	ОшибкаЗаписи = ЗаписатьИтогНаСервере();
	Если ЗначениеЗаполнено(ОшибкаЗаписи) Тогда
		ПоказатьПредупреждение(, ОшибкаЗаписи);
		Возврат;
	КонецЕсли;
	
	Оповестить("ЗафиксированИсходЛечения", ПервичныйПрием);
	Закрыть(Истина);
	
КонецПроцедуры

#КонецОбласти
